'''
A. Полка раздора
Не решена
Ограничение времени
1 секунда
Ограничение памяти
256 Мб
Ввод
стандартный ввод или input.txt
Вывод
стандартный вывод или output.txt
Вася решил сделать из квадратного куска фанеры прямоугольную полочку для дома.
Для этого он взял на работе кусок фанеры и отпилил и выбросил от него полосу шириной а, сделав вертикальный разрез.
После этого он отрезал полосу высотой в сделав горизонтальный разрез, и также выбросил её.
Площадь оставшейся полочки была равна S.

После этого у Васи начались неприятности. Во-первых, начальник заметил исчезновение листа фанеры и обязал Васю купить за свой счет точно такой же лист. Во-вторых, жена выбросила полочку, так что измерить её Вася не может и всё что он помнит - это числа а, b и S.
В магазине продаются только квадратные листы фанеры с целочисленными сторонами. Помогите Васе определите размеры листа, который он использовал, либо определите, что такого не существует.

Формат ввода
Вводятся три целых числа a, bи S (0 a, b _ 104, 1 S 108).

Формат вывода
Если необходимый лист фанеры есть в продаже, то выведите длину его стороны L.
Если же такого листа с целочисленными сторонами не может существовать, то выведите
«-1».

Пример 1
Ввод
Вывод
1 1 1

Пример 2
Ввод
Вывод
2 3 12

Пример 3
Ввод
Вывод
1 1 2
'''