# Ограничение времени    3 секунды
# Ограничение памяти    256 Мб
# Ввод    стандартный ввод или input.txt
# Вывод    стандартный вывод или output.txt

# Вася составляет отборочный контест на стажировку. Сотрудники компании подготовили n задач, для каждой из задач определена тема, к которой она относится. Отборочный контест состоит ровно из k задач. Помогите Васе выбрать k задач из n так, чтобы они покрывали как можно больше различных тем.

# Формат ввода 

# В первой строке вводится два целых числа n, k (1 <= k <= n <= 100000) — количество задач, придуманных сотрудниками, и количество задач в контесте. В следующей строке записано n числе ai (1 <= ai <= 10^9) — тема, к которой относится задача с номером i.

# Формат вывода

# Выведите ровно k целых чисел через пробел - темы задач, которые нужно взять в контест. Если правильных ответов несколько — выведите любой из них.

# Пример 1

# input

# 5 3
# 1 1 1 2 2

# output

# 1 2 1 

# Пример 2

# input

# 10 4
# 8 8 8 8 8 8 8 8 2 1

# output

# 1 2 8 8 