# Ограничение времени    1 секунда
# Ограничение памяти    256 Мб
# Ввод    стандартный ввод или input.txt
# Вывод    стандартный вывод или output.txt

# Дана таблица из n, m символов, каждый символ может быть либо «+», либо «-», либо «?». Символ «+» означает число +1 , символ «-» — число -1, а символ «?» может быть заменён на «+» или «-».

# Формат ввода

# В первой строке записаны два числа n, m (1 <= n, m <= 1000) — количество строк и столбцов в таблице соответственно.

# Далее идут n строк по m символов, содержащие только «+», «-» и «?».

# Формат вывода

# Выведите одно число — максимально возможную разность.

# Пример 1

# input

# 4 3
# +-+
# ??-
# ?-?
# ++?

# output

# 5

# Пример 2

# input

# 6 10
# ??+++-?-?-
# -??+???--+
# ?-+?+-?+--
# ??????--?+
# ++--?--+-?
# ?-?+++?+-?

# output

# 12

