            #   code.mu (Основной учебник)
            
        # 3. Вывод данных на экран Python
        
    # Функция print помогает вывести нужную нам информацию в консоль. Давайте выведем какую-нибудь строку:

# print('hello')

    # А теперь выведем число:

# print(1)

            # 4. Философия Python

# import this

            # 5. Комментарии в Python

        # В языке Python можно оставлять комментарии. Они бывают однострочными и многострочными.

        # Однострочный комментарий можно сделать с помощью значка хештега #:

# test

        # А чтобы оставить многострочный комментарий, нужно заключить его в тройные кавычки:

"""
	test1
	test2
	test3
"""

            # 6. Переменные в Python
        
        # Основным понятием любого языка программирования является переменная. Переменная представляет собой контейнер, в котором мы можем хранить какие-либо данные, например, строки или числа.

        # Каждая переменная должна иметь имя, которое может состоять из латинских букв, чисел и знаков подчеркивания. В Python мы объявляем переменную просто записав ее имя, а через оператор = указываем ее значение

            # 7. Вывод переменной в консоль в Python

        # Чтобы вывести значение нашей переменной, нужно воспользоваться функцией print:
'''
test = 1
print(test) # выведет в консоль 1
'''

            # 8. Математические операции с числами в Python
        # В Python можно выполнять все основные математические операции. Давайте рассмотрим ниже каждую из них.

'''
        # Сложение:
test = 1 + 2
print(test) # выведет 3

        # Вычитание:
test = 2 - 1
print(test) # выведет 1

        # Умножение:
test = 3 * 2
print(test) # выведет 6

        # Деление:
test = 4 / 2
print(test) # выведет 2

        # Деление нацело:
test = 10 // 3
print(test) # выведет 3
'''

            # 9. 